# Q1_P2
### • Use ‘vehicle_collisions’ data set.
### • For each borough, find out distribution of each collision scale. (One carinvolved? Two? Three? or more?) (From 2015 to present)
### • Display a few rows of the output use df.head().
### • Generate a csv output with five columns ('borough', 'one-vehicle', 'twovehicles', 'three-vehicles', 'more-vehicles')

In [73]:
import pandas as pd
from pandas import DataFrame

In [74]:
raw_data = pd.read_csv('Data/vehicle_collisions.csv')
# raw_data.head(4)
# to get the data columns that we need
raw_data = raw_data[['BOROUGH', 'VEHICLE 1 TYPE', 'VEHICLE 2 TYPE', 'VEHICLE 3 TYPE', 'VEHICLE 4 TYPE']]
raw_data.head(6)

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE
0,QUEENS,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN
1,NaN,PASSENGER VEHICLE,NaN,NaN,NaN
2,BROOKLYN,PASSENGER VEHICLE,UNKNOWN,NaN,NaN
3,BROOKLYN,BUS,PASSENGER VEHICLE,NaN,NaN
4,NaN,UNKNOWN,PASSENGER VEHICLE,NaN,NaN
5,BROOKLYN,PASSENGER VEHICLE,SPORT UTILITY/STATION WAGON,SPORT UTILITY/STATION WAGON,PASSENGER VEHICLE

In [75]:
# to calculate how many involved vehicle
raw_data['VEHICLE COUNT'] = raw_data.count(axis =1)-1
raw_data.head()

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE COUNT
0,QUEENS,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,1
1,NaN,PASSENGER VEHICLE,NaN,NaN,NaN,0
2,BROOKLYN,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,2
3,BROOKLYN,BUS,PASSENGER VEHICLE,NaN,NaN,2
4,NaN,UNKNOWN,PASSENGER VEHICLE,NaN,NaN,1

In [76]:
# keep the columns we need
raw_data = raw_data[['BOROUGH', 'VEHICLE COUNT']]
raw_data.head(3)

    BOROUGH  VEHICLE COUNT
0    QUEENS              1
1       NaN              0
2  BROOKLYN              2

In [77]:
# to clean the raw_data deleting 0 in VEHICLE COUNT
raw_data = raw_data[raw_data['VEHICLE COUNT'] != 0]
raw_data.head(6)

    BOROUGH  VEHICLE COUNT
0    QUEENS              1
2  BROOKLYN              2
3  BROOKLYN              2
4       NaN              1
5  BROOKLYN              4
6    QUEENS              3

In [78]:
# to clean the raw_data deleting NAN in BOROUGH
raw_data = raw_data[pd.notnull(raw_data['BOROUGH'])]
raw_data.head(6)

    BOROUGH  VEHICLE COUNT
0    QUEENS              1
2  BROOKLYN              2
3  BROOKLYN              2
5  BROOKLYN              4
6    QUEENS              3
7  BROOKLYN              2

In [79]:
# raw_data.columns.dtype   dtype('O')
# change datatype and make VEHICLE COUNT >3 become 3+
raw_data['VEHICLE COUNT'] =raw_data['VEHICLE COUNT'].apply(lambda x : str(x) if x < 4 else '3+')
raw_data.head(6)

    BOROUGH VEHICLE COUNT
0    QUEENS             1
2  BROOKLYN             2
3  BROOKLYN             2
5  BROOKLYN            3+
6    QUEENS             3
7  BROOKLYN             2

In [80]:
# to groupt borough and vehicle count, then calculate the occurance of each count in each borough
raw_data2 = raw_data.groupby(['BOROUGH','VEHICLE COUNT'],as_index=False).size().reset_index()

In [81]:
raw_data2 .head(6)

    BOROUGH VEHICLE COUNT      0
0     BRONX             1   8627
1     BRONX             2  34385
2     BRONX             3   1962
3     BRONX            3+    625
4  BROOKLYN             1  17375
5  BROOKLYN             2  80207

In [84]:
# to use Borough as index,vehicle count as columns
raw_data3 = raw_data2.pivot(index='BOROUGH',columns='VEHICLE COUNT',values=0)

In [85]:
raw_data3

VEHICLE COUNT      1      2     3    3+
BOROUGH
BRONX           8627  34385  1962   625
BROOKLYN       17375  80207  4980  1612
MANHATTAN      13318  66958  2024   501
QUEENS         12962  70260  4498  1420
STATEN ISLAND   2343  10676   759   165

In [86]:
# change thre columns name
raw_data3.columns = ['ONE_VEHICLE_INVOLVED', 'TWO_VEHICLE_INVOLVED', 'THREE_VEHICLE_INVOLVED', 'MORE_VEHICLE_INVOLVED']
raw_data3

,ONE_VEHICLE_INVOLVED,TWO_VEHICLE_INVOLVED,THREE_VEHICLE_INVOLVED,MORE_VEHICLE_INVOLVED
BOROUGH,,,,
BRONX,8627,34385,1962,625
BROOKLYN,17375,80207,4980,1612
MANHATTAN,13318,66958,2024,501
QUEENS,12962,70260,4498,1420
STATEN ISLAND,2343,10676,759,165

In [87]:
final_data = raw_data3.reset_index()
final_data

,BOROUGH,ONE_VEHICLE_INVOLVED,TWO_VEHICLE_INVOLVED,THREE_VEHICLE_INVOLVED,MORE_VEHICLE_INVOLVED
0,BRONX,8627,34385,1962,625
1,BROOKLYN,17375,80207,4980,1612
2,MANHATTAN,13318,66958,2024,501
3,QUEENS,12962,70260,4498,1420
4,STATEN ISLAND,2343,10676,759,165

In [89]:
# to output the result
final_data.to_csv('Output/Q1_P2.csv',index = False,header=True)